import java.util.Scanner;

public class task12 {
    /*Напишите программу на Java, которая принимает три числа в качестве входных данных
    для вычисления и печати среднего числа. */
    public static void main(String[] args) {
        System.out.println("Введите число 1");
        int num1 = new Scanner(System.in).nextInt();
        System.out.println("Введите число 2");
        int num2 = new Scanner(System.in).nextInt();
        System.out.println("Введите число 3");
        int num3 = new Scanner(System.in).nextInt();
        System.out.println(num1);
        System.out.println(num2);
        System.out.println(num3);
    }
}
