/*Напишите Java-программу для печати результата следующих операций.
        Тестовые данные:
        а. -5 + 8 * 6
        б. (55 + 9)% 9
        с. 20 + -3 * 5/8
        д. 5 + 15/3 * 2 - 8% 3
        Ожидаемый результат :
        43
        1
        19
        13*/

public class task4 {
    public static void main(String[] args) {
        System.out.println(-5 + 8 * 6);
        System.out.println((55 + 9)% 9);
        System.out.println(20 + -3 * 5/8);
        System.out.println(5 + 15/3 * 2 - 8% 3);
    }
}
