/*Напишите программу на Java для печати значения ascii данного символа. Перейти к редактору
        Ожидаемый результат

        Значение ASCII Z: 90*/
public class Task41 {
    public static void main(String[] args) {
        int chr = 'Z';
        System.out.println(" Значение ASCII Z: " + chr);
    }
}
