/*Напишите программу на Java для вывода суммы двух чисел.
        Тестовые данные:
        74 + 36
        Ожидаемый результат :
        110*/

public class task2 {
    public static void main(String[] args) {
        System.out.println(74+36);
    }
}
