/*Напишите программу на Java, чтобы разделить два числа и напечатать на экране.
        Тестовые данные:
        50/3
        Ожидаемый результат :
        16*/
public class task3 {
    public static void main(String[] args) {
        System.out.println(50/3);
    }
}
